package ch25.opp.innerclass;

public class InnerClassTheory {
    public static void main(String[] args) {
        /*
            내부 클래스

            내부클래스(Inner class)는 클래스 내에 선언되는 클래스이다

            내부클래스는 선언된 외부클래스에서만 사용되고, 
            벗어나서 사용되는 경우는 거의없다.

            외부클래스로 감싸서 외부에서 보이지 않게 함으로써
            캡슐을 싼 것과 같다고 하여 캡슐화라고도 한다.

            
            내부클래스의 종류

            인스턴스 클래스 
            외부클래스의 다른 메서드 등의 블록 영역에 있지 않고,
            클래스의 영역에 선언되는 클래스이다.

            스태틱 클래스 
            인스턴스클래스와 유사하나, static이 붙는다.
            static 메서드 등에 사용될 목적으로 선언한다.

            지역 클래스
            내부클래스를 감싼 외부클래스의 메서드나 초기화 영역에 선언하며,
            해당 영역세어만 사용할 목적으로 선언한다.

            익명클래스
            클래스를 선언하면서 객체를 동시에 선언하는 방법이다.
            이름없는 클래스여서 익명클래스라고 한다
            안드로이드 프로그래밍을 할 때 곧잘 사용된다.
        */

        /*
            내부클래스의 제어자와 접근성

            내부클래스의 제어자와 접근성은 일반적인 클래스와 변수, 
            메서드의 제어자와 유사하다.
        */
    }
}
