package ch14.opp.overriding;

public class OverridingTheory01 {
    public static void main(String[] args) {
        
        /*
            오버라이딩
            상위 클래스에 정의된 메서드를 하위 클로스에서 다시 정의하는 행위

            오버라이딩은 부모의 메서드를 변경하는 개념이다.
            완전히 새로운 것이 아니다.

            비슷한 이름의 오버로딩은 다른 파라미터 형태를 넣어서
            완전히 새로운 것을 정의하는 것이다.

            오버로딩과 오버라이딩의 차이이다.

            
            조상 클래스의 메서드를 오버라이딩할 때 조건

            이름이 같아야 한다.
            매개변수가 같아야 한다.
            반환타입이 같아야 한다.
            조상 클래스의 메서드의 접근 제어자가보다 더 좁은 범위로 지정할 수 없다.
            예외처리를 조상클래스의 메서드보다 많이 할 수 없다.
            객체 메서드를 static 메서드, 또는 static 메서드를 객체 메서드로 변경할 수 없다.

        */
    }
}
