package ch16.opp.inheritance;

public class InheritanceTheory {
    public static void main(String[] args) {
        /*
            상속
            
            클래스 재사용 기법
            부모 클래스를 만들어서 자식 클래스에서 상속받아
            부모 클래스의 속성과 기능을 사용하는 것.

            상속은 부모클래스의 기본 구성 요소들을 물려받아 사용이 가능하다.
            상속받은 후 기능을 고쳐서 사용이 가능하다.
            extends를 사용하여 상속한다.
            자바는 다중상속이 불가능하다.


            상속의 장점

            코드의 재사용성을 높여 중복을 제거한다.
            재사용성이 높기 때문에 프로그램 생산성이 높아진다.
            유지보수가 편리해진다.

            모든 클래스들의 조상 클래스

            Object 클래스라는 것이 존재한다.
            최상위 클래스이며 가장 기본이 되는 클래스이다.

            Object 클래스
            클래스에 extends를 붙여서 하지 않을 경우, Object 클래스가 부모 클래스가 된다.

            super
            부모 클래스의 것을 불러과서 쓸 때는 super를 사용한다.
        */
    }
}
